In [24]:
import pandas as pd
from pandas import Series, DataFrame

In [25]:
obj = pd.Series([4, 7, -5, 3])

In [26]:
obj
# out displays the index in the left column and the numbers in the array in the right one

0    4
1    7
2   -5
3    3
dtype: int64

In [27]:
obj.values
# displays values included in the array

array([ 4,  7, -5,  3])

In [28]:
obj.index
# description of dafault indexing

RangeIndex(start=0, stop=4, step=1)

In [29]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
# indexing in order, d, 4 - b, 7 etc

In [30]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [31]:
obj2.index
# we also get info on the dtype

Index(['d', 'b', 'a', 'c'], dtype='object')

In [32]:
obj2['a']

-5

In [33]:
obj2['d']

4

In [34]:
obj2['d'] = 6

In [35]:
obj2[['c', 'a', 'd']]
# this is interpreted as indices

c    3
a   -5
d    6
dtype: int64

In [36]:
obj2[obj2 > 0]
# displays int bigger than 0

d    6
b    7
c    3
dtype: int64

In [37]:
obj2 * 2
# multiplies each number in the array with 2

d    12
b    14
a   -10
c     6
dtype: int64

In [38]:
import numpy as np

In [39]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [40]:
'b' in obj2

True

In [41]:
'e' in obj2

False

In [42]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [43]:
obj3 = pd.Series(sdata)
# displays columns and rows, in left column the key and on the right the value

In [44]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [45]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [46]:
obj4 = pd.Series(sdata, index=states)
# assign order for indexing. if the index is not existing, response NaN

In [47]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [48]:
pd.isnull(obj4)
# bool to test which have no values

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [49]:
pd.notnull(obj4)
# bool to check which have values

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [50]:
obj4.isnull()
# this have the same outcome as pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [51]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [52]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [53]:
obj3 + obj4
# if int and float are combined the dtype is float

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [54]:
obj4.name = 'population'

In [55]:
obj4.index.name = 'state'
# displays at the top left

In [56]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [57]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [58]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [59]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [60]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# these each have their own column, with key name and list values below

In [61]:
frame = pd.DataFrame(data)

In [62]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [63]:
frame.head()
# displays the first five rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [64]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
            index=['one', 'two', 'three', 'four', 'five', 'six'])
# defining index/rows and categories/columns

In [65]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [66]:
frame2.columns
# displays categories/keys for columns and dtype

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [67]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [68]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [69]:
frame2.loc['three']
# displays all keys and values for index 'three'
# loc is locator attribute

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [70]:
frame2['debt'] = 16.5

In [71]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [72]:
frame2['debt'] = np.arange(6.)

In [73]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [74]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [75]:
frame2['debt'] = val

In [76]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [77]:
frame2['eastern'] = frame2.state == 'Ohio'
# creates a new column called 'easterns'

In [78]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [79]:
del frame2['eastern']

In [80]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [81]:
pop = {'Nevada': {2001: 2.4, 2002:2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
# outer keys are interpreted as columns
# NaN value will be displayed at the end

In [82]:
frame3 = pd.DataFrame(pop)

In [83]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [84]:
frame3.T
# swapping the rows with the columns

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [85]:
pd.DataFrame(pop, index=[2001, 2002, 2003])
# rows are indexes and defined to be the years

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [86]:
pdata = {'Ohio': frame3['Ohio'][:-1],
    'Nevada': frame3['Nevada'][:2]}
# this way is deprecated. we should use series.loc[i:j]

/tmp/ipykernel_4641/3195126122.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  pdata = {'Ohio': frame3['Ohio'][:-1],
/tmp/ipykernel_4641/3195126122.py:2: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  'Nevada': frame3['Nevada'][:2]}

In [87]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [88]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [89]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [90]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [91]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [92]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [93]:
index = obj.index

In [94]:
index

Index(['a', 'b', 'c'], dtype='object')

In [95]:
index[1:]

Index(['b', 'c'], dtype='object')

In [96]:
index[1] = 'd'
# typ error. Index objects are immutable/can't be modified

TypeError: Index does not support mutable operations

In [97]:
labels = pd.Index(np.arange(3))

In [98]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [99]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [100]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [101]:
obj2.index is labels

True

In [102]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [103]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [104]:
'Ohio' in frame3.columns

True

In [105]:
2003 in frame3.index

False

In [106]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [107]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [108]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [109]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [110]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [111]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [112]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [113]:
obj3.reindex(range(6), method='ffill')
# filling value in range six. blue, purple and yellow will all appear twice.

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [114]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
index=['a', 'c', 'd'],
columns=['Ohio', 'Texas', 'California'])
# nine values, shaped in three rows and three columns

In [115]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [116]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [117]:
frame2
# with reindexing another index was added that contain no value, hence NaN

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [118]:
states = ['Texas', 'Utah', 'California']

In [119]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [120]:
frame.loc[['a', 'b', 'c', 'd'], states]

KeyError: "['b'] not in index"

In [122]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])

In [124]:
new_obj = obj.drop('c')

In [125]:
new_obj

a    0
b    1
d    3
e    4
dtype: int64

In [130]:
obj.drop(['d', 'c'])
# drop removes the defined indexes

a    0
b    1
e    4
dtype: int64